p3-sciencequiz-erinsusanthomas-main/app/views/students/_form.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."active" = ? ORDER BY name  [["active", 1]]
---
        <%= f.input :grade, label_html: { class: 'active' } %>
        <%= f.input :organization_id, collection: Organization.alphabetical.active.to_a %>