p3-sciencequiz-erinsusanthomas-main/app/views/students/_team_history.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "student_teams" ON "teams"."id" = "student_teams"."team_id" WHERE "student_teams"."student_id" = ?  [["student_id", 7]]
SELECT  1 AS one FROM "teams" INNER JOIN "student_teams" ON "teams"."id" = "student_teams"."team_id" WHERE "student_teams"."student_id" = ? LIMIT ?  [["student_id", 24], ["LIMIT", 1]]
---
  <div class="card-content">
    <% if @student.teams.empty? %>