p3-sciencequiz-erinsusanthomas-main/app/models/student_team.rb

SELECT  "student_teams".* FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) ORDER BY "student_teams"."id" ASC LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
UPDATE "student_teams" SET "end_date" = ? WHERE "student_teams"."id" = ?  [["end_date", "2021-01-15"], ["id", 12]]
---
  def end_previous_team_assignment
    current_assignment = self.student.student_teams.current.first
    if current_assignment.nil?
      return true
    else
      current_assignment.update_attribute(:end_date, self.start_date.to_date)