p3-sciencequiz-erinsusanthomas-main/app/models/student.rb

  def current_team
    curr_team = self.student_teams.current
    return nil if curr_team.empty?
    curr_team.first.team   # return as a single object, not an array
---
SELECT  1 AS one FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) LIMIT ?  [["student_id", 7], ["LIMIT", 1]]
SELECT  "student_teams".* FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) ORDER BY "student_teams"."id" ASC LIMIT ?  [["student_id", 7], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]