p3-sciencequiz-erinsusanthomas-main/app/controllers/organizations_controller.rb

    def index
        @active_organizations = Organization.active.alphabetical.paginate(page: params[:page]).per_page(10)
---
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."active" = ?  [["active", 1]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."active" != ? ORDER BY name  [["active", 1]]

    def update
        if @organization.update(organization_params)
---
UPDATE "organizations" SET "street_1" = ?, "street_2" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["street_1", "251 East Ohio St"], ["street_2", ""], ["updated_at", "2021-04-02 17:03:47.642000"], ["id", 4]]

    def set_organization
        @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]