p3-sciencequiz-erinsusanthomas-main/app/controllers/student_teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "student_teams".* FROM "student_teams" WHERE "student_teams"."team_id" = ? AND (end_date IS NULL)  [["team_id", 6]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "student_teams".* FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL)  [["student_id", 15]]
---
    def new
        @student_team = StudentTeam.new
        if params[:team_id] != nil
            @team = Team.find(params[:team_id])
            @current_students = @team.student_teams.current.map{|a| a.student}
        end
        if params[:student_id] != nil
            @student = Student.find(params[:student_id])
            @current_team = @student.student_teams.current.map{|a| a.team}

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student_team
        @student_team = StudentTeam.find(params[:id])