p3-sciencequiz-erinsusanthomas-main/app/controllers/students_controller.rb

    def index
        @active_students = Student.active.alphabetical.paginate(page: params[:page]).per_page(10)
---
SELECT  "students".* FROM "students" WHERE "students"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "students" WHERE "students"."active" = ?  [["active", 1]]

    def create
        @student = Student.new(student_params)
        if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "grade", "organization_id") VALUES (?, ?, ?, ?)  [["first_name", "tom"], ["last_name", "tom"], ["grade", 3], ["organization_id", 1]]