p3-sciencequiz-erinsusanthomas-main/app/controllers/teams_controller.rb

    def create
        @team = Team.new(team_params)
        if @team.save
---
INSERT INTO "teams" ("name", "organization_id", "division") VALUES (?, ?, ?)  [["name", "m 2"], ["organization_id", 1], ["division", "junior"]]

    def destroy
        @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 9]]

    def set_team
        @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]