p3-sciencequiz-erinsusanthomas-main/app/views/student_teams/new.html.erb

          <%= if @student.junior?
                f.input :team_id, collection: Team.juniors.alphabetical.active.to_a - @current_team
---
SELECT "teams".* FROM "teams" WHERE "teams"."active" = ?  [["active", 1]]

          <%= f.input :team_id, as: :hidden, input_html: { value: @team.id } %>
          <%= f.input :student_id, collection: Student.alphabetical.active.to_a - @current_students %>
---
SELECT "students".* FROM "students" WHERE "students"."active" = ? ORDER BY last_name, first_name  [["active", 1]]