p3-sciencequiz-erinsusanthomas-main/app/views/teams/_active_teams.html.erb

SELECT COUNT(*) FROM "student_teams" WHERE "student_teams"."team_id" = ? AND (end_date IS NULL)  [["team_id", 1]]
---
            <td><%= link_to team.organization.name, organization_path(team.organization) %></td>
            <td><%= team.student_teams.current.size %></td>

SELECT COUNT(*) FROM "student_teams" WHERE "student_teams"."team_id" = ? AND "student_teams"."team_id" = ?  [["team_id", 6], ["team_id", 6]]
---
            <td><%= link_to team.organization.name, organization_path(team.organization)  %></td>
            <td><%= team.student_teams.current.size %></td>