p3-sciencequiz-erinsusanthomas-main/app/views/teams/_form.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."active" = ? ORDER BY name  [["active", 1]]
---
        <%= f.input :division, collection: Team::DIVISION_LIST %>
        <%= f.input :organization_id, collection: Organization.alphabetical.active.to_a %>